netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_initializeList_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:urn="wso2.connector.netsuite">
  <soapenv:Header/>
   <soapenv:Body>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:method>initializeList</urn:method>
     <urn:warningAsError></urn:warningAsError>
    <urn:disableMandatoryCustomFieldValidation></urn:disableMandatoryCustomFieldValidation>
    <urn:disableSystemNotesForCustomFields></urn:disableSystemNotesForCustomFields>
    <urn:ignoreReadOnlyFields></urn:ignoreReadOnlyFields>
      <urn:partnerId/>
      <urn:applicationId/>
      <urn:email>%s(email)</urn:email>
      <urn:password>%s(password)</urn:password>
      <urn:account>%s(account)</urn:account>
      <urn:roleInternalId/>
      <urn:roleExternalId/>
      <urn:roleType/>
      <urn:roleName/>
      <urn:initializeRecords>
         <platformMsgs:initializeRecord xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com" xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <platformCore:type>customerPayment</platformCore:type>
           <platformCore:reference type="customer" internalId="%s(addListMandatoryInternalId)"/>
         </platformMsgs:initializeRecord>
      </urn:initializeRecords>
   </soapenv:Body>
</soapenv:Envelope>

